In [1]:
import pandas as pd

In [2]:
df_l = pd.read_csv('data/final/Ensemble/Logistic.csv')
df_k = pd.read_csv('data/final/Ensemble/KNN.csv')
df_r = pd.read_csv('data/final/Ensemble/RandomForest.csv')

In [3]:
df_l.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [4]:
df_k.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         1
4          896         1

In [5]:
df_r.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [8]:
df = pd.concat([df_l.loc[:,['PassengerId','Survived']], df_k.loc[:,['Survived']], df_r.loc[:,['Survived']]], axis=1)
df.head()

   PassengerId  Survived  Survived  Survived
0          892         0         0         0
1          893         0         0         1
2          894         0         0         0
3          895         0         1         0
4          896         1         1         1

In [10]:
df.columns = ['PassengerId', 'L', 'K', 'R']
df.head()

   PassengerId  L  K  R
0          892  0  0  0
1          893  0  0  1
2          894  0  0  0
3          895  0  1  0
4          896  1  1  1

In [18]:
def majority_vote(row):
    if ((row['L']==1 and row['R']==1) or (row['L']==1 and row['K']==1) or (row['R']==1 and row['K']==1)):
        return 1
    else:
        return 0

In [21]:
df.apply(lambda row: majority_vote(row), axis=1).head()

0    0
1    0
2    0
3    0
4    1
dtype: int64

In [22]:
df['Survived'] = df.apply(lambda row: majority_vote(row), axis=1)
df.head()

   PassengerId  L  K  R  Survived
0          892  0  0  0         0
1          893  0  0  1         0
2          894  0  0  0         0
3          895  0  1  0         0
4          896  1  1  1         1

In [23]:
df.loc[:,['PassengerId','Survived']].to_csv('data/final/submission.csv', index=False)